copp.org
#+BABEL: :tangle no :cache no :session yes :results silent :no-expand yes :noweb yes :exports code :padline yes
#+startup: hideblocks overview fninline

Context Oriented Programming Patterns

context oriented programming is similar to aspect oriented programming.  it changes the way in which applications can be built.  many constructions which were previously complex or ugly, could now become trivial to implement.  i decided to write down the experiences i have whilst learning ContxtL in the form of reusable patterns because information about using ContextL seems to be sparse.


* preamble
describes needed libraries and some minor support code

** libraries
so far, this document doesn't export any code to lisp files.  if you'd want to run it, you should assume the following libraries are included in the package in which you evaluate the code:
- ContextL
- alexandria

** supporting code
the following functions are used throughout the code as simple helper functions.

*** operating on multiple layers
adjoin-layer and remove-layer operate on a single layer.  in some cases we want to operate on a list of layers.  this is handled by the following functions.

#+begin_src lisp
  (defun adjoin-layers (layers active-layers)
    (reduce #'adjoin-layer layers
            :initial-value active-layers
            :from-end t))
  
  (defun remove-layers (layers active-layers)
    (reduce #'remove-layer layers
            :initial-value active-layers
            :from-end t))
#+end_src

* backlinks                                                         :pattern:
under backlinks we understand the concept in which an instance links to another instance, and in which the other instance links back.  when one instance is updated, the other instance should be updated as well.  we can model this with contexts as follows:
- create functions to update the normal link of the object
- create a layer for managing the backlinks
- augment the methods for managing links in the new layer, with code which updates the previous and new links.

it's generally good to implement the lowest level at which the changes can occur.  for instance: it may be more interesting to extend slot-makunbound, than a custom method which turns out to call that method.

as an example, we implement a doubly linked tree.  the doubly linked tree is a tree in which the parent knows its children and vice versa.  the doubly linked tree guarentees that the relationship always is in sync.

** data definition
we create a new layer named consistent tree which ensures the tree stays in a consistent state and we implement a new layered class which contains slots for the parent and children relationships.  we assume a node has no parent when the parent is unbound.  we assume a node has no children when children is nil.  with this structure we can both look at how accessors can be extended, as look at how primitive methods like slot-makunbound can be overridden.

#+begin_src lisp
  (deflayer consistent-tree)
  
  (define-layered-class node
    ()
    ((parent :layered-accessor parent)
     (children :layered-accessor children :initform nil)))
#+end_src

** removing the parent of a node
removing a parent is handled by unbinding the parent.  as the class 'node is a layered class, we can extend the layered method slot-makunbound-using-layer.  when our parent is removed, we must remove ourselves from the list of children of our parent.  this removal must be done outside of our current layer, so as to ensure no other methods of our consistency-ensuring layer are being called.

#+begin_src lisp
  (define-layered-method slot-makunbound-using-layer
    :in-layer consistent-tree
    :before (class (node node) (slot (eql 'parent)) writer)
    (when (slot-boundp node 'parent)
      (with-inactive-layers (consistent-tree)
        (setf (children (parent node))
              (remove node (children (parent node)))))))
#+end_src

** setting the parent of a node
for setting the parent, we must firstly ensure that our possibly existing previous parent doesn't contain a link to us anymore.  secondly, we must make sure our new parent has us as a child.

we can first unset our parent and then set the new parent.  unsetting is done by unbinding the slot, which we must do in the consistent-tree layer to ensure that our previous parent doesn't know us anymore.  this will call slot-makunbound-using-layer which we've just implemented.  the next step is assigning the new parent.  setting the parent slot itself is done by the next method, however we must still ensure that our new parent knows us.  we manually add ourselves to its children.  again, as we're manually fixing things here, we disable the consistent-tree layer.

#+begin_src lisp
  (define-layered-method (setf parent)
    :in-layer consistent-tree
    :before (new-parent (node node))
    (slot-makunbound node 'parent)          ; disconnect previous
    (with-inactive-layers (consistent-tree) ; connect new
      (push node (children new-parent))))
#+end_src

