copp.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Context Oriented Programming Patterns</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-02-20 15:55:30 CET"/>
<meta name="author" content="Aad Versteden"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Context Oriented Programming Patterns</h1>


<p>
context oriented programming is similar to aspect oriented programming.  it changes the way in which applications can be built.  many constructions which were previously complex or ugly, could now become trivial to implement.  i decided to write down the experiences i have whilst learning ContxtL in the form of reusable patterns because information about using ContextL seems to be sparse.
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 preamble </a>
<ul>
<li><a href="#sec-1-1">1.1 libraries </a></li>
<li><a href="#sec-1-2">1.2 supporting code </a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 operating on multiple layers </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 backlinks</a>
<ul>
<li><a href="#sec-2-1">2.1 data definition </a></li>
<li><a href="#sec-2-2">2.2 removing the parent of a node </a></li>
<li><a href="#sec-2-3">2.3 setting the parent of a node </a></li>
<li><a href="#sec-2-4">2.4 updating the children of a node </a></li>
<li><a href="#sec-2-5">2.5 conclusion </a></li>
</ul>
</li>
<li><a href="#sec-3">3 depending on other layers</a>
<ul>
<li><a href="#sec-3-1">3.1 example: enable and warn </a></li>
<li><a href="#sec-3-2">3.2 example: enable and warn 2 </a></li>
<li><a href="#sec-3-3">3.3 general approach </a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 implementing the metaclass </a></li>
<li><a href="#sec-3-3-2">3.3.2 example use </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 an alternative to extensions by hooks</a>
<ul>
<li><a href="#sec-4-1">4.1 system implementer </a>
<ul>
<li><a href="#sec-4-1-1">4.1.1 old code </a></li>
<li><a href="#sec-4-1-2">4.1.2 new code </a></li>
<li><a href="#sec-4-1-3">4.1.3 conclusion for the system implementer </a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2 extension implementer </a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 old code </a></li>
<li><a href="#sec-4-2-2">4.2.2 new code </a></li>
<li><a href="#sec-4-2-3">4.2.3 advanced stuff </a></li>
<li><a href="#sec-4-2-4">4.2.4 conclusion </a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 system user </a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 old code </a></li>
<li><a href="#sec-4-3-2">4.3.2 new code </a></li>
<li><a href="#sec-4-3-3">4.3.3 conclusion </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> preamble </h2>
<div class="outline-text-2" id="text-1">

<p>describes needed libraries and some minor support code
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> libraries </h3>
<div class="outline-text-3" id="text-1-1">

<p>so far, this document doesn't export any code to lisp files.  if you'd want to run it, you should assume the following libraries are included in the package in which you evaluate the code:
</p><ul>
<li>ContextL
</li>
<li>alexandria
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> supporting code </h3>
<div class="outline-text-3" id="text-1-2">

<p>the following functions are used throughout the code as simple helper functions.
</p>

</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> operating on multiple layers </h4>
<div class="outline-text-4" id="text-1-2-1">

<p>adjoin-layer and remove-layer operate on a single layer.  in some cases we want to operate on a list of layers.  this is handled by the following functions.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">adjoin-layers</span> (layers active-layers)
  (reduce #'adjoin-layer layers
          <span style="color: #728a05;">:initial-value</span> active-layers
          <span style="color: #728a05;">:from-end</span> t))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">remove-layers</span> (layers active-layers)
  (reduce #'remove-layer layers
          <span style="color: #728a05;">:initial-value</span> active-layers
          <span style="color: #728a05;">:from-end</span> t))
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> backlinks &nbsp;&nbsp;&nbsp;<span class="tag"><span class="pattern">pattern</span></span></h2>
<div class="outline-text-2" id="text-2">

<p>under backlinks we understand the concept in which an instance links to another instance, and in which the other instance links back.  when one instance is updated, the other instance should be updated as well.  we can model this with contexts as follows:
</p><ul>
<li>create functions to update the normal link of the object
</li>
<li>create a layer for managing the backlinks
</li>
<li>augment the methods for managing links in the new layer, with code which updates the previous and new links.
</li>
</ul>


<p>
it's generally good to implement the lowest level at which the changes can occur.  for instance: it may be more interesting to extend slot-makunbound, than a custom method which turns out to call that method.
</p>
<p>
as an example, we implement a doubly linked tree.  the doubly linked tree is a tree in which the parent knows its children and vice versa.  the doubly linked tree guarentees that the relationship always is in sync.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> data definition </h3>
<div class="outline-text-3" id="text-2-1">

<p>we create a new layer named consistent tree which ensures the tree stays in a consistent state and we implement a new layered class which contains slots for the parent and children relationships.  we assume a node has no parent when the parent is unbound.  we assume a node has no children when children is nil.  with this structure we can both look at how accessors can be extended, as look at how primitive methods like slot-makunbound can be overridden.
</p>



<pre class="src src-lisp">(deflayer consistent-tree)

(<span style="color: #728a05;">define-layered-class</span> node
  ()
  ((parent <span style="color: #728a05;">:layered-accessor</span> parent)
   (children <span style="color: #728a05;">:layered-accessor</span> children <span style="color: #728a05;">:initform</span> nil)))
</pre>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> removing the parent of a node </h3>
<div class="outline-text-3" id="text-2-2">

<p>removing a parent is handled by unbinding the parent.  as the class 'node is a layered class, we can extend the layered method slot-makunbound-using-layer.  when our parent is removed, we must remove ourselves from the list of children of our parent.  this removal must be done outside of our current layer, so as to ensure no other methods of our consistency-ensuring layer are being called.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">define-layered-method</span> slot-makunbound-using-layer
  <span style="color: #728a05;">:in-layer</span> consistent-tree
  <span style="color: #728a05;">:before</span> (class (node node) (slot (eql 'parent)) writer)
  (<span style="color: #728a05;">when</span> (slot-boundp node 'parent)
    (<span style="color: #728a05;">with-inactive-layers</span> (consistent-tree)
      (setf (children (parent node))
            (remove node (children (parent node)))))))
</pre>


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> setting the parent of a node </h3>
<div class="outline-text-3" id="text-2-3">

<p>for setting the parent, we must firstly ensure that our possibly existing previous parent doesn't contain a link to us anymore.  secondly, we must make sure our new parent has us as a child.
</p>
<p>
we can first unset our parent and then set the new parent.  unsetting is done by unbinding the slot, which we must do in the consistent-tree layer to ensure that our previous parent doesn't know us anymore.  this will call slot-makunbound-using-layer which we've just implemented.  the next step is assigning the new parent.  setting the parent slot itself is done by the next method, however we must still ensure that our new parent knows us.  we manually add ourselves to its children.  again, as we're manually fixing things here, we disable the consistent-tree layer.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">define-layered-method</span> (setf parent)
  <span style="color: #728a05;">:in-layer</span> consistent-tree
  <span style="color: #728a05;">:before</span> (new-parent (node node))
  (slot-makunbound node 'parent)          <span style="color: #81908f; font-weight: bold;">; </span><span style="color: #81908f; font-style: italic;">disconnect previous</span>
  (<span style="color: #728a05;">with-inactive-layers</span> (consistent-tree) <span style="color: #81908f; font-weight: bold;">; </span><span style="color: #81908f; font-style: italic;">connect new</span>
    (push node (children new-parent))))
</pre>


</div>

</div>
