copp.org
** updating the children of a node
the basic format for updating the children of the node is similar to that of updating the parent.  this time around, we'll be operating on lists of children.  we collect the children which are to be added in the variable to-add and the children which are to be removed in the variable to-remove.
- remove old children :: in a first step all children which don't exist in the new set of children are removed.  this is executed in the consistent-tree layer to ensure that the removed children and their current parents are left in a consistent state.
- add new children :: the regular setf is handled by a parent method, however we should ensure that all new children have the right parent set.  this should be done outside the current layer as we're handling all possible invalid states manually.

#+begin_src lisp
  (define-layered-method (setf children)
    :in-layer consistent-tree
    :before (new-children (node node))
    (let ((to-add (set-difference new-children (children node)))
          (to-remove (set-difference (children node) new-children)))
      ;; disconnect previous
      (when (children node)
        (dolist (child to-remove)
          (slot-makunbound child 'parent)))
      ;; connect new
      (with-inactive-layers (consistent-tree)
        (dolist (child to-add)
          (setf (parent child) node)))))
#+end_src

** conclusion
by disabling layers at will, we can influence the code which we call.  disabling our own layer can make operations which must stay consistent simple to implement, and easy to understand.  by placing this code in a separate layer, it's split from other code which may operate on these primitives thus decreasing the scope of the code.

* depending on other layers                                     :abstraction:
when programming with contexts, we may have a context which depends on another context to be active.  there are various options for configuring this.
- explicitly enable :: a layer may require another layer to be explicitly enabled.  if the layer is not enabled, we should enable the layer.
- warn on failure :: throw a warning if the layer we depend on isn't available.
- error on failure :: throw an error if the layer we depend on isn't available.
- static dependency :: it may be the case that we know we depend on a static amount of layers.  this will allow for caching.
- dynamic dependency :: it could be so that we depend on the layers dynamically.  we then need to check the dependency each time the layer is added or removed from the set of active layers.
- bi-dependent relationship :: it's possible that both layers depend on each other.  when one layer is active, the other layer must be active as well.  this means that we must also disable the other layer, when the current layer is removed.

not all of these are currently implemented.  in three steps we envolve from a solution which only works for one case, to a more generic solution which declaratively specifies our request.

** example: enable and warn
in order to manually handle the creation and removing, we need to create a metaclass for our layer.  we can then override the adjoin-layer-using-class method and manually require the required layer there.  if the second value we return is T, the result of enabling the layer could be cached.  in this case we can't do that, as we want to be able to warn that the required layer wasn't active yet.

#+begin_src lisp
  (defclass enable-and-warn-meta (standard-layer-class) ())
  
  (deflayer depending-layer ()
    ()
    (:metaclass enable-and-warn-meta))
  
  (deflayer another-layer ())
  
  (define-layered-method adjoin-layer-using-class
    :around ((meta enable-and-warn-meta) active-layers)
    (unless (layer-active-p 'another-layer active-layers)
      (warn "required layer ~A wasn't active" 'another-layer))
    (values (call-next-layered-method meta (adjoin-layer 'another-layer active-layers))
            nil))
#+end_src

