copp.html

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> updating the children of a node </h3>
<div class="outline-text-3" id="text-2-4">

<p>the basic format for updating the children of the node is similar to that of updating the parent.  this time around, we'll be operating on lists of children.  we collect the children which are to be added in the variable to-add and the children which are to be removed in the variable to-remove.
</p><dl>
<dt>remove old children</dt><dd>in a first step all children which don't exist in the new set of children are removed.  this is executed in the consistent-tree layer to ensure that the removed children and their current parents are left in a consistent state.
</dd>
<dt>add new children</dt><dd>the regular setf is handled by a parent method, however we should ensure that all new children have the right parent set.  this should be done outside the current layer as we're handling all possible invalid states manually.
</dd>
</dl>





<pre class="src src-lisp">(<span style="color: #728a05;">define-layered-method</span> (setf children)
  <span style="color: #728a05;">:in-layer</span> consistent-tree
  <span style="color: #728a05;">:before</span> (new-children (node node))
  (<span style="color: #728a05;">let</span> ((to-add (set-difference new-children (children node)))
        (to-remove (set-difference (children node) new-children)))
    <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">disconnect previous</span>
    (<span style="color: #728a05;">when</span> (children node)
      (<span style="color: #728a05;">dolist</span> (child to-remove)
        (slot-makunbound child 'parent)))
    <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">connect new</span>
    (<span style="color: #728a05;">with-inactive-layers</span> (consistent-tree)
      (<span style="color: #728a05;">dolist</span> (child to-add)
        (setf (parent child) node)))))
</pre>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> conclusion </h3>
<div class="outline-text-3" id="text-2-5">

<p>by disabling layers at will, we can influence the code which we call.  disabling our own layer can make operations which must stay consistent simple to implement, and easy to understand.  by placing this code in a separate layer, it's split from other code which may operate on these primitives thus decreasing the scope of the code.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> depending on other layers &nbsp;&nbsp;&nbsp;<span class="tag"><span class="abstraction">abstraction</span></span></h2>
<div class="outline-text-2" id="text-3">

<p>when programming with contexts, we may have a context which depends on another context to be active.  there are various options for configuring this.
</p><dl>
<dt>explicitly enable</dt><dd>a layer may require another layer to be explicitly enabled.  if the layer is not enabled, we should enable the layer.
</dd>
<dt>warn on failure</dt><dd>throw a warning if the layer we depend on isn't available.
</dd>
<dt>error on failure</dt><dd>throw an error if the layer we depend on isn't available.
</dd>
<dt>static dependency</dt><dd>it may be the case that we know we depend on a static amount of layers.  this will allow for caching.
</dd>
<dt>dynamic dependency</dt><dd>it could be so that we depend on the layers dynamically.  we then need to check the dependency each time the layer is added or removed from the set of active layers.
</dd>
<dt>bi-dependent relationship</dt><dd>it's possible that both layers depend on each other.  when one layer is active, the other layer must be active as well.  this means that we must also disable the other layer, when the current layer is removed.
</dd>
</dl>


<p>
not all of these are currently implemented.  in three steps we envolve from a solution which only works for one case, to a more generic solution which declaratively specifies our request.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> example: enable and warn </h3>
<div class="outline-text-3" id="text-3-1">

<p>in order to manually handle the creation and removing, we need to create a metaclass for our layer.  we can then override the adjoin-layer-using-class method and manually require the required layer there.  if the second value we return is T, the result of enabling the layer could be cached.  in this case we can't do that, as we want to be able to warn that the required layer wasn't active yet.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">defclass</span> <span style="color: #a57705;">enable-and-warn-meta</span> (standard-layer-class) ())

(deflayer depending-layer ()
  ()
  (<span style="color: #728a05;">:metaclass</span> enable-and-warn-meta))

(deflayer another-layer ())

(<span style="color: #728a05;">define-layered-method</span> adjoin-layer-using-class
  <span style="color: #728a05;">:around</span> ((meta enable-and-warn-meta) active-layers)
  (<span style="color: #728a05;">unless</span> (layer-active-p 'another-layer active-layers)
    (<span style="color: #c60007; font-weight: bold;">warn</span> <span style="color: #259185;">"required layer ~A wasn't active"</span> 'another-layer))
  (values (call-next-layered-method meta (adjoin-layer 'another-layer active-layers))
          nil))
</pre>


</div>

</div>
