copp.org
** example: enable and warn 2
in its implementation, deflayer creates a class and has options for specifying a metaclass.  extra options are allowed and are sent to the creation of the instance of the metaclass, representing the layer.  layer metaclasses should inherit from standard-layer-class.  with this we can allow our users to specify their configuration declaratyvely as keywords.  we store the layers which need to be activated before us and after us in the class object.

#+begin_src lisp
  (defclass enable-and-warn-meta (standard-layer-class)
    ((required-layers-before :initform nil
                             :accessor required-layers-before
                             :initarg :enabled-before-me)
     (required-layers-after :initform nil
                            :accessor required-layers-after
                            :initarg :enabled-after-me))
    (:documentation "layer which allows for requiring other layers to be called before and after our current layer"))
#+end_src

with this in place, we can implement the adjoin-layer-using-class method for our metaclass.  some things are noteworthy here.  as we can require layers to be executed before our layer and after our layer, we need to ensure that they are executed in the right order.  when we say a layer is executed before us, we mean that that layer wraps around our layer, the example near the end should explain this.  the variable active-befores contains all layers which need to be activate before we are activated.  the variable inactive-afters contains all the layers which need to be activated after us, but which haven't already been activated.

#+begin_src lisp
  (define-layered-method adjoin-layer-using-class
    :around ((meta enable-and-warn-meta) active-layers)
    (let ((active-befores (remove-if-not (rcurry #'layer-active-p active-layers)
                                         (required-layers-before meta)))
          (inactive-afters (remove-if (rcurry #'layer-active-p active-layers)
                                      (required-layers-after meta))))
      (when active-befores
        (warn "some before layers were already active. disabling them to ensure correct execution order: ~A" active-befores)
        (setf active-layers
              (remove-layers active-befores active-layers)))
      (when inactive-afters
        ;; handled in first call values makes
        (warn "some after layers aren't active yet.  enabling them to ensure correct execution order: ~A" inactive-afters))
      (values
       (adjoin-layers (required-layers-before meta)
                      (call-next-layered-method
                       meta
                       (adjoin-layers inactive-afters active-layers)))
       nil)))
#+end_src

an example use case showcases how everyhting works, we create a layer which needs one layer activated before itself and one layer to be activated after itself.  there's no inherent reason why we couldn't specify more layers in :enabled-before-me or :enabled-after-me.  we pick one for the brevity of the example.  in a first step we define all layers.  from there on we construct a layered function which prints something.  we define a :before on each of the layers so we can see when the layer can perform its actions.  we add a test function to showcase the current use.

#+begin_src lisp
  (deflayer depending-layer ()
    ()
    (:metaclass enable-and-warn-meta)
    (:enabled-before-me before-me-layer)
    (:enabled-after-me after-me-layer))
  
  (deflayer before-me-layer)
  (deflayer after-me-layer)
  
  (define-layered-function output-something ())
  
  (define-layered-method output-something
             ()
             (format T "~&default output~&"))
  
  (define-layered-method output-something
             :in-layer before-me-layer
             :before ()
             (format T "~&before me layer~&"))
  
  (define-layered-method output-something
             :in-layer after-me-layer
             :before ()
             (format T "~&after me layer~&"))
  
  (define-layered-method output-something
             :in-layer depending-layer
             :before ()
             (format T "~&in myself~&"))
  
  (defun test-output-something ()
    (format T "~&~%==no active layers==~&~%")
    (output-something)
    ;; > default output
  
    (format T "~&~%==activating depending-layer only==~&~%")
    (with-active-layers (depending-layer)
      (output-something))
    ;; > warning:
    ;; >    some after layers aren't active yet.  enabling them to ensure correct execution order: (after-me-layer)
    ;; > before me layer
    ;; > in myself
    ;; > after me layer
    ;; > default output
    (format T "~&~%==activating after-me-layer depending-layer before-me-layer==~&~%")
    (with-active-layers (after-me-layer depending-layer before-me-layer)
      (output-something))
    ;; > before me layer
    ;; > in myself
    ;; > after me layer
    ;; > default output
    (format T "~&~%==done testing==~&"))
#+end_src

** general approach
although many extra features could be added to a metaclass which allows for requiring other layers, we keep it to the basics for now.  interesting features which haven't been implemented yet would be:
- automatic disabling of automatically enabled layers :: layers which are enabled now, are not disabled when the layer that created them is removed.  support for this should be optional, as other layers might've depended on this layer also (within the same system, that could be discovered also).  unless more constraints are added, this can't be cached.
- naive loop detection at runtime :: as we declaratively specify which layers we depend on, it's very well possible we create an infinite loop when trying to discover which layers need to be enabled for the current layer.
- co-dependent layers :: if both layers depend on each other in the same order, then the layers need to be activated and deactivated together.  this allows us to use the cache whilst still allowing for enabling and disabling the layers correctly.

