copp.html

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> example: enable and warn 2 </h3>
<div class="outline-text-3" id="text-3-2">

<p>in its implementation, deflayer creates a class and has options for specifying a metaclass.  extra options are allowed and are sent to the creation of the instance of the metaclass, representing the layer.  layer metaclasses should inherit from standard-layer-class.  with this we can allow our users to specify their configuration declaratyvely as keywords.  we store the layers which need to be activated before us and after us in the class object.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">defclass</span> <span style="color: #a57705;">enable-and-warn-meta</span> (standard-layer-class)
  ((required-layers-before <span style="color: #728a05;">:initform</span> nil
                           <span style="color: #728a05;">:accessor</span> required-layers-before
                           <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:enabled-before-me</span>)
   (required-layers-after <span style="color: #728a05;">:initform</span> nil
                          <span style="color: #728a05;">:accessor</span> required-layers-after
                          <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:enabled-after-me</span>))
  (<span style="color: #728a05;">:documentation</span> <span style="color: #259185;">"layer which allows for requiring other layers to be called before and after our current layer"</span>))
</pre>


<p>
with this in place, we can implement the adjoin-layer-using-class method for our metaclass.  some things are noteworthy here.  as we can require layers to be executed before our layer and after our layer, we need to ensure that they are executed in the right order.  when we say a layer is executed before us, we mean that that layer wraps around our layer, the example near the end should explain this.  the variable active-befores contains all layers which need to be activate before we are activated.  the variable inactive-afters contains all the layers which need to be activated after us, but which haven't already been activated.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">define-layered-method</span> adjoin-layer-using-class
  <span style="color: #728a05;">:around</span> ((meta enable-and-warn-meta) active-layers)
  (<span style="color: #728a05;">let</span> ((active-befores (remove-if-not (rcurry #'layer-active-p active-layers)
                                       (required-layers-before meta)))
        (inactive-afters (remove-if (rcurry #'layer-active-p active-layers)
                                    (required-layers-after meta))))
    (<span style="color: #728a05;">when</span> active-befores
      (<span style="color: #c60007; font-weight: bold;">warn</span> <span style="color: #259185;">"some before layers were already active. disabling them to ensure correct execution order: ~A"</span> active-befores)
      (setf active-layers
            (remove-layers active-befores active-layers)))
    (<span style="color: #728a05;">when</span> inactive-afters
      <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">handled in first call values makes</span>
      (<span style="color: #c60007; font-weight: bold;">warn</span> <span style="color: #259185;">"some after layers aren't active yet.  enabling them to ensure correct execution order: ~A"</span> inactive-afters))
    (values
     (adjoin-layers (required-layers-before meta)
                    (call-next-layered-method
                     meta
                     (adjoin-layers inactive-afters active-layers)))
     nil)))
</pre>


<p>
an example use case showcases how everyhting works, we create a layer which needs one layer activated before itself and one layer to be activated after itself.  there's no inherent reason why we couldn't specify more layers in :enabled-before-me or :enabled-after-me.  we pick one for the brevity of the example.  in a first step we define all layers.  from there on we construct a layered function which prints something.  we define a :before on each of the layers so we can see when the layer can perform its actions.  we add a test function to showcase the current use.
</p>



<pre class="src src-lisp">(deflayer depending-layer ()
  ()
  (<span style="color: #728a05;">:metaclass</span> enable-and-warn-meta)
  (<span style="color: #728a05;">:enabled-before-me</span> before-me-layer)
  (<span style="color: #728a05;">:enabled-after-me</span> after-me-layer))

(deflayer before-me-layer)
(deflayer after-me-layer)

(<span style="color: #728a05;">define-layered-function</span> output-something ())

(<span style="color: #728a05;">define-layered-method</span> output-something
           ()
           (format T <span style="color: #259185;">"~&amp;default output~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> before-me-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;before me layer~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> after-me-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;after me layer~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> depending-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;in myself~&amp;"</span>))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">test-output-something</span> ()
  (format T <span style="color: #259185;">"~&amp;~%==no active layers==~&amp;~%"</span>)
  (output-something)
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>

  (format T <span style="color: #259185;">"~&amp;~%==activating depending-layer only==~&amp;~%"</span>)
  (<span style="color: #728a05;">with-active-layers</span> (depending-layer)
    (output-something))
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; warning:</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt;    some after layers aren't active yet.  enabling them to ensure correct execution order: (after-me-layer)</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; before me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; in myself</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; after me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>
  (format T <span style="color: #259185;">"~&amp;~%==activating after-me-layer depending-layer before-me-layer==~&amp;~%"</span>)
  (<span style="color: #728a05;">with-active-layers</span> (after-me-layer depending-layer before-me-layer)
    (output-something))
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; before me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; in myself</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; after me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>
  (format T <span style="color: #259185;">"~&amp;~%==done testing==~&amp;"</span>))
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> general approach </h3>
<div class="outline-text-3" id="text-3-3">

<p>although many extra features could be added to a metaclass which allows for requiring other layers, we keep it to the basics for now.  interesting features which haven't been implemented yet would be:
</p><dl>
<dt>automatic disabling of automatically enabled layers</dt><dd>layers which are enabled now, are not disabled when the layer that created them is removed.  support for this should be optional, as other layers might've depended on this layer also (within the same system, that could be discovered also).  unless more constraints are added, this can't be cached.
</dd>
<dt>naive loop detection at runtime</dt><dd>as we declaratively specify which layers we depend on, it's very well possible we create an infinite loop when trying to discover which layers need to be enabled for the current layer.
</dd>
<dt>co-dependent layers</dt><dd>if both layers depend on each other in the same order, then the layers need to be activated and deactivated together.  this allows us to use the cache whilst still allowing for enabling and disabling the layers correctly.
</dd>
</dl>



</div>
