copp.org
*** implementing the metaclass
the metaclass specification gains some extra configuration options.  these options are simply the configuration of what the adjoin-layer-using-class will execute.

#+begin_src lisp
  (defclass depending-meta (standard-layer-class)
    ((required-layers-before :initform nil
                             :accessor required-layers-before
                             :initarg :enabled-before-me)
     (required-layers-after :initform nil
                            :accessor required-layers-after
                            :initarg :enabled-after-me)
     (warn-on-oddities :initform nil
                       :reader warn-on-oddities-p
                       :initarg :warn-p)
     (may-be-cached-p :initform t
                      :reader may-be-cached-p
                      :initarg :cached-p))
    (:documentation "layer which allows for requiring other layers to be called before and after our current layer"))
  
  (define-layered-method adjoin-layer-using-class
    :around ((meta depending-meta) active-layers)
    (let ((active-befores (remove-if-not (rcurry #'layer-active-p active-layers)
                                         (required-layers-before meta)))
          (inactive-afters (remove-if (rcurry #'layer-active-p active-layers)
                                      (required-layers-after meta))))
      (when active-befores
        (when (warn-on-oddities-p meta)
          (warn "some before layers were already active. disabling them to ensure correct execution order: ~A" active-befores))
        (setf active-layers
              (remove-layers active-befores active-layers)))
      (when (and inactive-afters (warn-on-oddities-p meta))
        ;; handled in first call values makes
        (warn "some after layers aren't active yet.  enabling them to ensure correct execution order: ~A" inactive-afters))
      (values
       (adjoin-layers (required-layers-before meta)
                      (call-next-layered-method
                       meta
                       (adjoin-layers inactive-afters active-layers)))
       (may-be-cached-p meta))))
#+end_src

*** example use
we adapt the previous example so it showcases the features of the new metaclass.  with the caching turned on, we can't replicate the receival of warnings.

#+begin_src lisp
  (deflayer middle-layer ()
    ()
    (:metaclass depending-meta)
    (:enabled-before-me before-me-layer)
    (:enabled-after-me after-me-layer)
    (:warn-p t)
    (:cached-p t))
  
  (deflayer before-me-layer)
  (deflayer after-me-layer)
  
  (define-layered-function output-something ())
  
  (define-layered-method output-something
             ()
             (format T "~&default output~&"))
  
  (define-layered-method output-something
             :in-layer before-me-layer
             :before ()
             (format T "~&before me layer~&"))
  
  (define-layered-method output-something
             :in-layer after-me-layer
             :before ()
             (format T "~&after me layer~&"))
  
  (define-layered-method output-something
             :in-layer middle-layer
             :before ()
             (format T "~&in myself~&"))
  
  (defun test-output-something ()
    (format T "~&~%==no active layers==~&~%")
    (output-something)
    ;; > default output
  
    (format T "~&~%==activating depending-layer only (1)==~&~%")
    (with-active-layers (middle-layer)
      (output-something))
    ;; > warning:
    ;; >    some after layers aren't active yet.  enabling them to ensure correct execution order: (after-me-layer)
    ;; > before me layer
    ;; > in myself
    ;; > after me layer
    ;; > default output
    
    (format T "~&~%==activating dependent-layer only (2)==~&~%")
    (with-active-layers (middle-layer)
      (output-something))
    ;; > before me layer
    ;; > in myself
    ;; > after me layer
    ;; > default output
    (format T "~& -> the warning is gone, layer activation was cached~&")
  
    (format T "~&~%==activating after-me-layer depending-layer before-me-layer==~&~%")
    (with-active-layers (after-me-layer middle-layer before-me-layer)
      (output-something))
    ;; > before me layer
    ;; > in myself
    ;; > after me layer
    ;; > default output
    (format T "~&~%==done testing==~&"))
#+end_src
* an alternative to extensions by hooks                             :pattern:
in order to let users extend applications, it's customary to provide hooks in various places of the code, mostly at the start and/or end of some important method.  such use can easily be replicated with context oriented programming.  for simplicity, this example assumes the application is started by a form which the user can wrap.  we split the trivial explanation in three parts:
- system implementer :: explains what the base system which provides the hooks should implement.
- extension implementer :: explains what the creator of extensions to the base system should implement.
- system user :: explains what the user, who wants to enable the extensions, should do to enable them.

as an example we extend a fictive application with hooks.  we assume a currently undefined hooks library is available.  the application contains bunnies, cookies, and has a way of eating hem.  as it's just a pigment of my imagination, it also contains other unexplained configuration.

