copp.html

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> implementing the metaclass </h4>
<div class="outline-text-4" id="text-3-3-1">

<p>the metaclass specification gains some extra configuration options.  these options are simply the configuration of what the adjoin-layer-using-class will execute.
</p>



<pre class="src src-lisp">(<span style="color: #728a05;">defclass</span> <span style="color: #a57705;">depending-meta</span> (standard-layer-class)
  ((required-layers-before <span style="color: #728a05;">:initform</span> nil
                           <span style="color: #728a05;">:accessor</span> required-layers-before
                           <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:enabled-before-me</span>)
   (required-layers-after <span style="color: #728a05;">:initform</span> nil
                          <span style="color: #728a05;">:accessor</span> required-layers-after
                          <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:enabled-after-me</span>)
   (warn-on-oddities <span style="color: #728a05;">:initform</span> nil
                     <span style="color: #728a05;">:reader</span> warn-on-oddities-p
                     <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:warn-p</span>)
   (may-be-cached-p <span style="color: #728a05;">:initform</span> t
                    <span style="color: #728a05;">:reader</span> may-be-cached-p
                    <span style="color: #728a05;">:initarg</span> <span style="color: #728a05;">:cached-p</span>))
  (<span style="color: #728a05;">:documentation</span> <span style="color: #259185;">"layer which allows for requiring other layers to be called before and after our current layer"</span>))

(<span style="color: #728a05;">define-layered-method</span> adjoin-layer-using-class
  <span style="color: #728a05;">:around</span> ((meta depending-meta) active-layers)
  (<span style="color: #728a05;">let</span> ((active-befores (remove-if-not (rcurry #'layer-active-p active-layers)
                                       (required-layers-before meta)))
        (inactive-afters (remove-if (rcurry #'layer-active-p active-layers)
                                    (required-layers-after meta))))
    (<span style="color: #728a05;">when</span> active-befores
      (<span style="color: #728a05;">when</span> (warn-on-oddities-p meta)
        (<span style="color: #c60007; font-weight: bold;">warn</span> <span style="color: #259185;">"some before layers were already active. disabling them to ensure correct execution order: ~A"</span> active-befores))
      (setf active-layers
            (remove-layers active-befores active-layers)))
    (<span style="color: #728a05;">when</span> (and inactive-afters (warn-on-oddities-p meta))
      <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">handled in first call values makes</span>
      (<span style="color: #c60007; font-weight: bold;">warn</span> <span style="color: #259185;">"some after layers aren't active yet.  enabling them to ensure correct execution order: ~A"</span> inactive-afters))
    (values
     (adjoin-layers (required-layers-before meta)
                    (call-next-layered-method
                     meta
                     (adjoin-layers inactive-afters active-layers)))
     (may-be-cached-p meta))))
</pre>


</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> example use </h4>
<div class="outline-text-4" id="text-3-3-2">

<p>we adapt the previous example so it showcases the features of the new metaclass.  with the caching turned on, we can't replicate the receival of warnings.
</p>



<pre class="src src-lisp">(deflayer middle-layer ()
  ()
  (<span style="color: #728a05;">:metaclass</span> depending-meta)
  (<span style="color: #728a05;">:enabled-before-me</span> before-me-layer)
  (<span style="color: #728a05;">:enabled-after-me</span> after-me-layer)
  (<span style="color: #728a05;">:warn-p</span> t)
  (<span style="color: #728a05;">:cached-p</span> t))

(deflayer before-me-layer)
(deflayer after-me-layer)

(<span style="color: #728a05;">define-layered-function</span> output-something ())

(<span style="color: #728a05;">define-layered-method</span> output-something
           ()
           (format T <span style="color: #259185;">"~&amp;default output~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> before-me-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;before me layer~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> after-me-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;after me layer~&amp;"</span>))

(<span style="color: #728a05;">define-layered-method</span> output-something
           <span style="color: #728a05;">:in-layer</span> middle-layer
           <span style="color: #728a05;">:before</span> ()
           (format T <span style="color: #259185;">"~&amp;in myself~&amp;"</span>))

(<span style="color: #728a05;">defun</span> <span style="color: #2075c7;">test-output-something</span> ()
  (format T <span style="color: #259185;">"~&amp;~%==no active layers==~&amp;~%"</span>)
  (output-something)
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>

  (format T <span style="color: #259185;">"~&amp;~%==activating depending-layer only (1)==~&amp;~%"</span>)
  (<span style="color: #728a05;">with-active-layers</span> (middle-layer)
    (output-something))
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; warning:</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt;    some after layers aren't active yet.  enabling them to ensure correct execution order: (after-me-layer)</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; before me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; in myself</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; after me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>

  (format T <span style="color: #259185;">"~&amp;~%==activating dependent-layer only (2)==~&amp;~%"</span>)
  (<span style="color: #728a05;">with-active-layers</span> (middle-layer)
    (output-something))
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; before me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; in myself</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; after me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>
  (format T <span style="color: #259185;">"~&amp; -&gt; the warning is gone, layer activation was cached~&amp;"</span>)

  (format T <span style="color: #259185;">"~&amp;~%==activating after-me-layer depending-layer before-me-layer==~&amp;~%"</span>)
  (<span style="color: #728a05;">with-active-layers</span> (after-me-layer middle-layer before-me-layer)
    (output-something))
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; before me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; in myself</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; after me layer</span>
  <span style="color: #81908f; font-weight: bold;">;; </span><span style="color: #81908f; font-style: italic;">&gt; default output</span>
  (format T <span style="color: #259185;">"~&amp;~%==done testing==~&amp;"</span>))
</pre>

</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> an alternative to extensions by hooks &nbsp;&nbsp;&nbsp;<span class="tag"><span class="pattern">pattern</span></span></h2>
<div class="outline-text-2" id="text-4">

<p>in order to let users extend applications, it's customary to provide hooks in various places of the code, mostly at the start and/or end of some important method.  such use can easily be replicated with context oriented programming.  for simplicity, this example assumes the application is started by a form which the user can wrap.  we split the trivial explanation in three parts:
</p><dl>
<dt>system implementer</dt><dd>explains what the base system which provides the hooks should implement.
</dd>
<dt>extension implementer</dt><dd>explains what the creator of extensions to the base system should implement.
</dd>
<dt>system user</dt><dd>explains what the user, who wants to enable the extensions, should do to enable them.
</dd>
</dl>


<p>
as an example we extend a fictive application with hooks.  we assume a currently undefined hooks library is available.  the application contains bunnies, cookies, and has a way of eating hem.  as it's just a pigment of my imagination, it also contains other unexplained configuration.
</p>

</div>
